hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/crypto/nrf_crypto_ecc.h
typedef nrf_crypto_backend_bp384r1_key_pair_generate_context_t
nrf_crypto_ecc_bp384r1_key_pair_generate_context_t;              /**< @brief Context structure for key generation using bp384r1 (Brainpool 384-bit). */
typedef nrf_crypto_backend_bp384r1_public_key_calculate_context_t
nrf_crypto_ecc_bp384r1_public_key_calculate_context_t;           /**< @brief Context structure for public key calculation using bp384r1 (Brainpool 384-bit). */
typedef nrf_crypto_backend_bp384r1_private_key_t
nrf_crypto_ecc_bp384r1_private_key_t;                            /**< @brief Structure holding internal representation of a private key for bp384r1 (Brainpool 384-bit) */
typedef nrf_crypto_backend_bp384r1_public_key_t
nrf_crypto_ecc_bp384r1_public_key_t;                             /**< @brief Structure holding internal representation of a public key for bp384r1 (Brainpool 384-bit) */
typedef uint8_t nrf_crypto_ecc_bp384r1_raw_private_key_t
[NRF_CRYPTO_ECC_BP384R1_RAW_PRIVATE_KEY_SIZE];                   /**< @brief Array holding raw private key for bp384r1 (Brainpool 384-bit) */
typedef uint8_t nrf_crypto_ecc_bp384r1_raw_public_key_t
[NRF_CRYPTO_ECC_BP384R1_RAW_PUBLIC_KEY_SIZE];                    /**< @brief Array holding raw public key for bp384r1 (Brainpool 384-bit) */


#if NRF_CRYPTO_ECC_BP384R1_ENABLED

/** @brief Variable containing information on bp384r1 (Brainpool 384-bit).

    It can be used as a parameter for the functions creating bp384r1 (Brainpool 384-bit) keys.
*/
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_bp384r1_curve_info;

#endif

/** @} */


/** @addtogroup nrf_crypto_ecc_bp512r1
    @{ */

typedef nrf_crypto_backend_bp512r1_key_pair_generate_context_t
nrf_crypto_ecc_bp512r1_key_pair_generate_context_t;              /**< @brief Context structure for key generation using bp512r1 (Brainpool 512-bit). */
typedef nrf_crypto_backend_bp512r1_public_key_calculate_context_t
nrf_crypto_ecc_bp512r1_public_key_calculate_context_t;           /**< @brief Context structure for public key calculation using bp512r1 (Brainpool 512-bit). */
typedef nrf_crypto_backend_bp512r1_private_key_t
nrf_crypto_ecc_bp512r1_private_key_t;                            /**< @brief Structure holding internal representation of a private key for bp512r1 (Brainpool 512-bit) */
typedef nrf_crypto_backend_bp512r1_public_key_t
nrf_crypto_ecc_bp512r1_public_key_t;                             /**< @brief Structure holding internal representation of a public key for bp512r1 (Brainpool 512-bit) */
typedef uint8_t nrf_crypto_ecc_bp512r1_raw_private_key_t
[NRF_CRYPTO_ECC_BP512R1_RAW_PRIVATE_KEY_SIZE];                   /**< @brief Array holding raw private key for bp512r1 (Brainpool 512-bit) */
typedef uint8_t nrf_crypto_ecc_bp512r1_raw_public_key_t
[NRF_CRYPTO_ECC_BP512R1_RAW_PUBLIC_KEY_SIZE];                    /**< @brief Array holding raw public key for bp512r1 (Brainpool 512-bit) */


#if NRF_CRYPTO_ECC_BP512R1_ENABLED

/** @brief Variable containing information on bp512r1 (Brainpool 512-bit).

    It can be used as a parameter for the functions creating bp512r1 (Brainpool 512-bit) keys.
*/
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_bp512r1_curve_info;

#endif

/** @} */


/** @addtogroup nrf_crypto_ecc_curve25519
    @{ */

typedef nrf_crypto_backend_curve25519_key_pair_generate_context_t
nrf_crypto_ecc_curve25519_key_pair_generate_context_t;           /**< @brief Context structure for key generation using Curve25519. */
typedef nrf_crypto_backend_curve25519_public_key_calculate_context_t
nrf_crypto_ecc_curve25519_public_key_calculate_context_t;        /**< @brief Context structure for public key calculation using Curve25519. */
typedef nrf_crypto_backend_curve25519_private_key_t
nrf_crypto_ecc_curve25519_private_key_t;                         /**< @brief Structure holding internal representation of a private key for Curve25519 */
typedef nrf_crypto_backend_curve25519_public_key_t
nrf_crypto_ecc_curve25519_public_key_t;                          /**< @brief Structure holding internal representation of a public key for Curve25519 */
typedef uint8_t nrf_crypto_ecc_curve25519_raw_private_key_t
[NRF_CRYPTO_ECC_CURVE25519_RAW_PRIVATE_KEY_SIZE];                /**< @brief Array holding raw private key for Curve25519 */
typedef uint8_t nrf_crypto_ecc_curve25519_raw_public_key_t
[NRF_CRYPTO_ECC_CURVE25519_RAW_PUBLIC_KEY_SIZE];                 /**< @brief Array holding raw public key for Curve25519 */


#if NRF_CRYPTO_ECC_CURVE25519_ENABLED

/** @brief Variable containing information on Curve25519.

    It can be used as a parameter for the functions creating Curve25519 keys.
*/
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_curve25519_curve_info;

#endif

/** @} */


/** @addtogroup nrf_crypto_ecc_ed25519
    @{ */

typedef nrf_crypto_backend_ed25519_key_pair_generate_context_t
nrf_crypto_ecc_ed25519_key_pair_generate_context_t;              /**< @brief Context structure for key generation using Ed25519. */
typedef nrf_crypto_backend_ed25519_public_key_calculate_context_t
nrf_crypto_ecc_ed25519_public_key_calculate_context_t;           /**< @brief Context structure for public key calculation using Ed25519. */
typedef nrf_crypto_backend_ed25519_private_key_t
nrf_crypto_ecc_ed25519_private_key_t;                            /**< @brief Structure holding internal representation of a private key for Ed25519 */
typedef nrf_crypto_backend_ed25519_public_key_t
nrf_crypto_ecc_ed25519_public_key_t;                             /**< @brief Structure holding internal representation of a public key for Ed25519 */
typedef uint8_t nrf_crypto_ecc_ed25519_raw_private_key_t
[NRF_CRYPTO_ECC_ED25519_RAW_PRIVATE_KEY_SIZE];                   /**< @brief Array holding raw private key for Ed25519 */
typedef uint8_t nrf_crypto_ecc_ed25519_raw_public_key_t
[NRF_CRYPTO_ECC_ED25519_RAW_PUBLIC_KEY_SIZE];                    /**< @brief Array holding raw public key for Ed25519 */


#if NRF_CRYPTO_ECC_ED25519_ENABLED

/** @brief Variable containing information on Ed25519.

