hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/crypto/nrf_crypto_ecc.h
/** @brief Create a private key from a raw data.

    Generated private key has to be deallocated using @ref nrf_crypto_ecc_private_key_free.

    @note Ed25519 only: Memory is allocated internally using @ref nrf_crypto_mem.

    @param[in]  p_curve_info   Pointer to information on selected curve. Use only global variables
                               defined by nrf_crypto, e.g. @ref g_nrf_crypto_ecc_secp256r1_curve_info.
    @param[out] p_private_key  Pointer to structure where newly converted private key will be put.
    @param[in]  p_raw_data     Pointer to buffer containing a big endian raw data.
    @param[in]  raw_data_size  Number of bytes of a raw data. Correct size for selected curve can be found in
                               @p p_curve_info and it is also defined by the preprocessor definitions, e.g.
                               @ref NRF_CRYPTO_ECC_SECP256R1_RAW_PRIVATE_KEY_SIZE.
*/
ret_code_t nrf_crypto_ecc_private_key_from_raw(
    nrf_crypto_ecc_curve_info_t  const *p_curve_info,
    nrf_crypto_ecc_private_key_t        *p_private_key,
    uint8_t                      const *p_raw_data,
    size_t                               raw_data_size);
    
    
/** @brief Convert a private key to a raw data.

    @param[in]     p_private_key    Pointer to structure holding private key that will be convert.
    @param[out]    p_raw_data       Pointer to buffer containing a big endian raw data.
    @param[in,out] p_raw_data_size  Maximum number of bytes that @p p_raw_data buffer can hold on input
                                    and the actual number of bytes used by the raw data on output.
                                    Actual size for selected curve can be found in
                                    @ref nrf_crypto_ecc_curve_info_t and it is also defined by
                                    the preprocessor definitions, e.g.
                                    @ref NRF_CRYPTO_ECC_SECP256R1_RAW_PRIVATE_KEY_SIZE.
*/
ret_code_t nrf_crypto_ecc_private_key_to_raw(
    nrf_crypto_ecc_private_key_t const *p_private_key,
    uint8_t                             *p_raw_data,
    size_t                              *p_raw_data_size);
    
    
/** @brief Create a public key from a raw data.

    Generated public key has to be deallocated using @ref nrf_crypto_ecc_public_key_free.
    @param[in]  p_curve_info   Pointer to information on selected curve. Use only global variables
                               defined by nrf_crypto, e.g. @ref g_nrf_crypto_ecc_secp256r1_curve_info.
    @param[out] p_public_key   Pointer to structure where newly converted public key will be put.
    @param[in]  p_raw_data     Pointer to buffer containing a big endian raw data.
    @param[in]  raw_data_size  Number of bytes of a raw data. Correct size for selected curve can be found in
                               @p p_curve_info and it is also defined by the preprocessor definitions, e.g.
                               @ref NRF_CRYPTO_ECC_SECP256R1_RAW_PUBLIC_KEY_SIZE.
*/
ret_code_t nrf_crypto_ecc_public_key_from_raw(
    nrf_crypto_ecc_curve_info_t const *p_curve_info,
    nrf_crypto_ecc_public_key_t        *p_public_key,
    uint8_t                     const *p_raw_data,
    size_t                              raw_data_size);
    
    
/** @brief Convert a public key to a raw data.

    @param[in]     p_public_key     Pointer to structure holding public key that will be convert.
    @param[out]    p_raw_data       Pointer to buffer containing a big endian raw data.
    @param[in,out] p_raw_data_size  Maximum number of bytes that @p p_raw_data buffer can hold on input
                                    and the actual number of bytes used by the raw data on output.
                                    Actual size for selected curve can be found in
                                    @ref nrf_crypto_ecc_curve_info_t and it is also defined by
                                    the preprocessor definitions, e.g.
                                    @ref NRF_CRYPTO_ECC_SECP256R1_RAW_PUBLIC_KEY_SIZE.
*/
ret_code_t nrf_crypto_ecc_public_key_to_raw(
    nrf_crypto_ecc_public_key_t const *p_public_key,
    uint8_t                            *p_raw_data,
    size_t                             *p_raw_data_size);
    
    
/** @brief Release resources taken by a private key.

    @param[in] p_private_key   Pointer to structure holding private key to release.
*/
ret_code_t nrf_crypto_ecc_private_key_free(
    nrf_crypto_ecc_private_key_t *p_private_key);
    
    
/** @brief Release resources taken by a public key.

    @param[in] p_public_key    Pointer to structure holding public key to release.
*/
ret_code_t nrf_crypto_ecc_public_key_free(
    nrf_crypto_ecc_public_key_t *p_public_key);
    
    
/** @brief Gets curve information structure from provided key (private or public).

    @param[in]  p_key          Pointer to structure holding private or public key.
    @param[out] pp_curve_info  Pointer to location where put retrieved pointer to curve information structure.
*/
ret_code_t nrf_crypto_ecc_curve_info_get(
    void                         const *p_key,
    nrf_crypto_ecc_curve_info_t const **pp_curve_info);
    
    
/** @brief Inverts byte order of a big integers contained in a raw data.

    All the ECC API accepts only data with big endian integers, so this function have to be used
    if little endian is required. If input is in little endian byte order it will be converted
    to big endian. If input is in big endian byte order it will be converted to little endian.
    It works for ECC raw private key, raw public key, signature and shared secret. If raw data
    contains two big integers (e.g. R, S, or X, Y) each integer is inverted separately.
    If @p p_curve_info is NULL then all bytes in buffer will be inverted regardless what is the
    content of the buffer.

    @param[in]  p_curve_info   Pointer to information on selected curve. Use only global variables
                               defined by nrf_crypto, e.g. @ref g_nrf_crypto_ecc_secp256r1_curve_info.
    @param[in]  p_raw_input    Pointer to buffer holding source data.
    @param[out] p_raw_output   Pointer to buffer that will be filled with inverted byte order.
                               This parameter can be the same as @p p_raw_input, otherwise the
                               buffers cannot overlap.
    @param[in]  raw_data_size  Size of input and output buffer.
*/
ret_code_t nrf_crypto_ecc_byte_order_invert(
    nrf_crypto_ecc_curve_info_t const *p_curve_info,
    uint8_t                     const *p_raw_input,
    uint8_t                            *p_raw_output,
    size_t                              raw_data_size);
    
    
#ifdef __cplusplus
}
#endif

/** @}
    @}
*/

#endif // NRF_CRYPTO_ECC_H__
